#-*-coding:utf-8-*-
'''Задание 5
Создать вручную список, содержащий цены на товары (10–20 товаров), например:
[57.8, 46.51, 97, ...]

Вывести на экран эти цены через запятую в одну строку, цена должна отображаться в виде <r> руб <kk> коп.
Например:
57 руб 08 коп, 46 руб 51 коп, 97 руб 00 коп, ...

Подумать, как из цены получить рубли и копейки, как добавить нули, если, например, получилось 7 копеек или 0 копеек (должно быть 07 коп или 00 коп).

Вывести цены, отсортированные по возрастанию, новый список не создавать (доказать, что объект списка после сортировки остался тот же).

Создать новый список, содержащий те же цены, но отсортированные по убыванию.

Вывести цены пяти самых дорогих товаров. Сможете ли вывести цены этих товаров по возрастанию, написав минимум кода?s'''

coast_list = [57.8, 46.51, 97, 67.02, 89.4, 45.78, 78, 56.02, 3.5, 7.04,98.01]
print('ID списка:',id(coast_list))
coast_list.sort()
print('ID сортированного списка:',id(coast_list))
print('по по возрастанию:')
for i in coast_list:
    print('{0:02d} руб {1:02d} коп'.format(int(i),round((i-int(i))*100)),end=',')#особенности дробной математики python

coast_list1=coast_list[::-1]
print('\nпо убыванию:')
for i in coast_list1:
    print('{0:02d} руб {1:02d} коп'.format(int(i), round((i - int(i)) * 100)),end=',')  # особенности дробной математики python
print('\n5 самых дорогих:')
for i in coast_list[-5:]:
    print('{0:02d} руб {1:02d} коп'.format(int(i), round((i - int(i)) * 100)), end=',')  # особенности дробной математики python

